app/controllers/items_controller.rb

	def index
		@item = Item.all
---
SELECT "items".* FROM "items"

	def create
		@item = Item.new(item_params)
		if @item.save
---
INSERT INTO "items" ("serial_number", "description", "supplier", "status", "lender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

	def show
		@item = Item.find(params[:id].to_i)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def edit
		@item = Item.find(params[:id].to_i)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@item = Item.find(params[:id].to_i)
		@item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "description" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["description", "mouse & computer"], ["updated_at", "2018-03-14 19:39:07.121314"], ["id", 2]]

	def destroy
		@item = Item.find(params[:id].to_i)
		@item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 1]]